In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

In [2]:
#create path
path = r'C:\Users\jacob\Documents\Data Analytics\Data Immersion\Achievement 6\Energy_GDP_Project'

In [3]:
#import oil gas coal data
ogc = pd.read_csv(os.path.join(path, '02 data', 'original data', 'energy_from_oil_gas_coal.csv'))

In [4]:
#check output
ogc.head()

       country  year       combined key  %_energy_fossil_fuels
0  Afghanistan  1990  Afghanistan, 1990                    NaN
1  Afghanistan  1991  Afghanistan, 1991                    NaN
2  Afghanistan  1992  Afghanistan, 1992                    NaN
3  Afghanistan  1993  Afghanistan, 1993                    NaN
4  Afghanistan  1994  Afghanistan, 1994                    NaN

In [5]:
#check for missing values
ogc.isnull().sum()

country                     0
year                        0
combined key                0
%_energy_fossil_fuels    2155
dtype: int64

In [6]:
#check for duplicates
ogc.duplicated().value_counts()

False    6916
Name: count, dtype: int64

In [7]:
ogc.shape

(6916, 4)

In [8]:
ogc.describe()

              year  %_energy_fossil_fuels
count  6916.000000            4761.000000
mean   2002.500000              60.233161
std       7.500542              30.825572
min    1990.000000               0.000000
25%    1996.000000              38.051821
50%    2002.500000              65.799204
75%    2009.000000              87.455189
max    2015.000000             100.000000

In [9]:
#group data by country and then look for missing values by country
ogc_grouped = ogc.groupby('country')['%_energy_fossil_fuels'].value_counts(dropna = False)

In [10]:
ogc_grouped

country                      %_energy_fossil_fuels
Afghanistan                  NaN                      26
Africa Eastern and Southern  73.521705                 1
                             66.606766                 1
                             68.475772                 1
                             69.501043                 1
                                                      ..
Zimbabwe                     70.742822                 1
                             70.746383                 1
                             70.909838                 1
                             72.196417                 1
                             72.388859                 1
Name: count, Length: 4463, dtype: int64

Most of the missing values are a reulst of having no data on particualr countries. However, there are some countries that are missing some values. so rather than imputing zero for all of the values, we will create a new column that will act as a weighted average that we can then use to fill in the missing data points.

In [11]:
#create a weighted average column to fill in missing data values
ogc ['weighted_avg'] = ogc.groupby('country')['%_energy_fossil_fuels'].transform(lambda x : x.fillna(x.mean()))

In [12]:
ogc.head(150)

,country,year,combined key,%_energy_fossil_fuels,weighted_avg
0,Afghanistan,1990,"Afghanistan, 1990",NaN,NaN
1,Afghanistan,1991,"Afghanistan, 1991",NaN,NaN
2,Afghanistan,1992,"Afghanistan, 1992",NaN,NaN
3,Afghanistan,1993,"Afghanistan, 1993",NaN,NaN
4,Afghanistan,1994,"Afghanistan, 1994",NaN,NaN
...,...,...,...,...,...
145,American Samoa,2005,"American Samoa, 2005",NaN,NaN
146,American Samoa,2006,"American Samoa, 2006",NaN,NaN
147,American Samoa,2007,"American Samoa, 2007",NaN,NaN
148,American Samoa,2008,"American Samoa, 2008",NaN,NaN
149,American Samoa,2009,"American Samoa, 2009",NaN,NaN

In [13]:
ogc.isnull().sum()

country                     0
year                        0
combined key                0
%_energy_fossil_fuels    2155
weighted_avg             2080
dtype: int64

In [14]:
#fill rest of the missing values with 0
ogc['weighted_avg'].fillna(0, inplace = True)

In [15]:
ogc.head(150)

,country,year,combined key,%_energy_fossil_fuels,weighted_avg
0,Afghanistan,1990,"Afghanistan, 1990",NaN,0.0
1,Afghanistan,1991,"Afghanistan, 1991",NaN,0.0
2,Afghanistan,1992,"Afghanistan, 1992",NaN,0.0
3,Afghanistan,1993,"Afghanistan, 1993",NaN,0.0
4,Afghanistan,1994,"Afghanistan, 1994",NaN,0.0
...,...,...,...,...,...
145,American Samoa,2005,"American Samoa, 2005",NaN,0.0
146,American Samoa,2006,"American Samoa, 2006",NaN,0.0
147,American Samoa,2007,"American Samoa, 2007",NaN,0.0
148,American Samoa,2008,"American Samoa, 2008",NaN,0.0
149,American Samoa,2009,"American Samoa, 2009",NaN,0.0

In [16]:
#check for missing values in weighted average column
ogc.isnull().sum()

country                     0
year                        0
combined key                0
%_energy_fossil_fuels    2155
weighted_avg                0
dtype: int64

In [17]:
#drop %_energy_fossil_fules column
ogc = ogc.drop(columns = ('%_energy_fossil_fuels'))

In [18]:
ogc.head()

       country  year       combined key  weighted_avg
0  Afghanistan  1990  Afghanistan, 1990           0.0
1  Afghanistan  1991  Afghanistan, 1991           0.0
2  Afghanistan  1992  Afghanistan, 1992           0.0
3  Afghanistan  1993  Afghanistan, 1993           0.0
4  Afghanistan  1994  Afghanistan, 1994           0.0

In [19]:
ogc.isnull().sum()

country         0
year            0
combined key    0
weighted_avg    0
dtype: int64

In [20]:
#rename weighted_average column to be new %_energy_fossil_fules column
ogc.rename( columns = {'weighted_avg' : '%_energy_fossil_fuels'}, inplace = True)

In [21]:
#check output
ogc.head()

       country  year       combined key  %_energy_fossil_fuels
0  Afghanistan  1990  Afghanistan, 1990                    0.0
1  Afghanistan  1991  Afghanistan, 1991                    0.0
2  Afghanistan  1992  Afghanistan, 1992                    0.0
3  Afghanistan  1993  Afghanistan, 1993                    0.0
4  Afghanistan  1994  Afghanistan, 1994                    0.0

In [22]:
#check output
ogc.describe()

              year  %_energy_fossil_fuels
count  6916.000000            6916.000000
mean   2002.500000              42.292349
std       7.500542              37.897291
min    1990.000000               0.000000
25%    1996.000000               0.000000
50%    2002.500000              41.938147
75%    2009.000000              76.383645
max    2015.000000             100.000000

In [23]:
#check shape
ogc.shape

(6916, 4)

In [28]:
#export wrangled oil gas coal data
ogc.to_csv(os.path.join(path, '02 data', 'prepared data', 'energy_from_oil_gas_coal_wrangled.csv'))